STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_p2pRouteur/STM32_WPAN/App/app_ble.c
      switch (meta_evt->subevent)
      {
        /* USER CODE BEGIN subevent */

        /* USER CODE END subevent */
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
          /* USER CODE BEGIN EVT_LE_CONN_COMPLETE */

          /* USER CODE END EVT_LE_CONN_COMPLETE */
          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */
          connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;

          connection_handle = connection_complete_event->Connection_Handle;
          role = connection_complete_event->Role;
          if (role == 0x00)
          { /* ROLE CENTRAL */

            uint8_t dev1 = 1;
#if (CFG_P2P_DEMO_MULTI != 0)
            /* USER CODE BEGIN EVT_LE_CONN_COMPLETE_Multi */
            uint8_t dev2 = 1, dev3 = 1, dev4 = 1, dev5 = 1, dev6 = 1;
            /* USER CODE END EVT_LE_CONN_COMPLETE_Multi */
#endif

            for (int i = 0; i < 6; i++)
            {
              dev1 &= (P2P_SERVER1_BDADDR[i] == connection_complete_event->Peer_Address[i]);
#if (CFG_P2P_DEMO_MULTI != 0)
              /* USER CODE BEGIN EVT_LE_CONN_COMPLETE_Multi_2 */
              dev2 &= (P2P_SERVER2_BDADDR[i] == connection_complete_event->Peer_Address[i]);
              dev3 &= (P2P_SERVER3_BDADDR[i] == connection_complete_event->Peer_Address[i]);
              dev4 &= (P2P_SERVER4_BDADDR[i] == connection_complete_event->Peer_Address[i]);
              dev5 &= (P2P_SERVER5_BDADDR[i] == connection_complete_event->Peer_Address[i]);
              dev6 &= (P2P_SERVER6_BDADDR[i] == connection_complete_event->Peer_Address[i]);
              /* USER CODE END EVT_LE_CONN_COMPLETE_Multi_2 */
#endif
            }

            if (dev1 == 1)
            {
              /* Inform Application it is End Device 1 */
              APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 1\n\r");
              BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_CONNECTED;
              BleApplicationContext.connectionHandleEndDevice1 = connection_handle;
              BleApplicationContext.BleApplicationContext_legacy.connectionHandle[0] = connection_handle;
              handleNotification.P2P_Evt_Opcode = P2P_SERVER1_CONN_HANDLE_EVT;
              handleNotification.ConnectionHandle = connection_handle;
              Evt_Notification(&handleNotification);
              result = aci_gatt_disc_all_primary_services(BleApplicationContext.connectionHandleEndDevice1);
              if (result == BLE_STATUS_SUCCESS)
              {
                APP_DBG_MSG("\r\n\r** GATT SERVICES & CHARACTERISTICS DISCOVERY  \n\r");
                APP_DBG_MSG("* GATT :  Start Searching Primary Services \r\n\r");
              }
              else
              {
                APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
              }
#if (CFG_P2P_DEMO_MULTI != 0)
              /* USER CODE BEGIN EVT_LE_CONN_COMPLETE_Multi_3 */
              /* Now try to connect to device 2 */
              if ((BleApplicationContext.EndDevice_Connection_Status[1] != APP_BLE_CONNECTED)
                  && (BleApplicationContext.EndDevice2Found == 0x01))
              {
                UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_2_ID, CFG_SCH_PRIO_0);
              }
              /* USER CODE END EVT_LE_CONN_COMPLETE_Multi_3 */
#endif
            }
#if (CFG_P2P_DEMO_MULTI != 0)
              /* USER CODE BEGIN EVT_LE_CONN_COMPLETE_Multi_4 */
              if (dev2 == 1)
              {
                /* Inform Application it is End Device 2 */
                APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 2\n");

                BleApplicationContext.EndDevice_Connection_Status[1] = APP_BLE_CONNECTED;
                BleApplicationContext.connectionHandleEndDevice2 = connection_handle;
                BleApplicationContext.BleApplicationContext_legacy.connectionHandle[1] = connection_handle;
                handleNotification.P2P_Evt_Opcode = P2P_SERVER2_CONN_HANDLE_EVT;
                handleNotification.ConnectionHandle = connection_handle;
                Evt_Notification(&handleNotification);
                result = aci_gatt_disc_all_primary_services(BleApplicationContext.connectionHandleEndDevice2);
                if (result == BLE_STATUS_SUCCESS)
                {
                  APP_DBG_MSG("* GATT : Start Searching Primary Services \r\n\r");
                }
                else
                {
                  APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
                }
                /* Now try to connect to device 1 */
                if ((BleApplicationContext.EndDevice_Connection_Status[0] != APP_BLE_CONNECTED)
                    && (BleApplicationContext.EndDevice1Found == 0x01))
                {
                  UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_1_ID, CFG_SCH_PRIO_0);
                }
              }
              if (dev3 == 1)
              {
                /* Inform Application it is End Device 3 */
                APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 3\n");

                BleApplicationContext.EndDevice_Connection_Status[2] = APP_BLE_CONNECTED;
                BleApplicationContext.connectionHandleEndDevice3 = connection_handle;
                BleApplicationContext.BleApplicationContext_legacy.connectionHandle[2] = connection_handle;
                handleNotification.P2P_Evt_Opcode = P2P_SERVER3_CONN_HANDLE_EVT;
                handleNotification.ConnectionHandle = connection_handle;
                Evt_Notification(&handleNotification);
                result = aci_gatt_disc_all_primary_services(BleApplicationContext.connectionHandleEndDevice3);
                if (result == BLE_STATUS_SUCCESS)
                {
                  APP_DBG_MSG("* GATT : Start Searching Primary Services \r\n\r");
                }
                else
                {
                  APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
                }

                /* Now try to connect to device 4 */
                if ((BleApplicationContext.EndDevice_Connection_Status[3] != APP_BLE_CONNECTED)
                    && (BleApplicationContext.EndDevice4Found == 0x01))
                {
                  UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_4_ID, CFG_SCH_PRIO_0);
                }
              }
              if (dev4 == 1)
              {
                /* Inform Application it is End Device 4 */
                APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 4\n");

                BleApplicationContext.EndDevice_Connection_Status[3] = APP_BLE_CONNECTED;
                BleApplicationContext.connectionHandleEndDevice4 = connection_handle;
                BleApplicationContext.BleApplicationContext_legacy.connectionHandle[3] = connection_handle;
                handleNotification.P2P_Evt_Opcode = P2P_SERVER4_CONN_HANDLE_EVT;
                handleNotification.ConnectionHandle = connection_handle;
                Evt_Notification(&handleNotification);
                result = aci_gatt_disc_all_primary_services(BleApplicationContext.connectionHandleEndDevice4);
                if (result == BLE_STATUS_SUCCESS)
                {
                  APP_DBG_MSG("* GATT : Start Searching Primary Services \r\n\r");
                }
                else
                {
                  APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
                }
                /* Now try to connect to device 3 */
                if ((BleApplicationContext.EndDevice_Connection_Status[2] != APP_BLE_CONNECTED)
                    && (BleApplicationContext.EndDevice3Found == 0x01))
                {
                  UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_3_ID, CFG_SCH_PRIO_0);
                }
              }
              if (dev5 == 1)
              {
                /* Inform Application it is End Device 5 */
                APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 5\n");

                BleApplicationContext.EndDevice_Connection_Status[4] = APP_BLE_CONNECTED;
                BleApplicationContext.connectionHandleEndDevice5 = connection_handle;
                BleApplicationContext.BleApplicationContext_legacy.connectionHandle[4] = connection_handle;
                handleNotification.P2P_Evt_Opcode = P2P_SERVER5_CONN_HANDLE_EVT;
                handleNotification.ConnectionHandle = connection_handle;
                Evt_Notification(&handleNotification);
                result = aci_gatt_disc_all_primary_services(BleApplicationContext.connectionHandleEndDevice5);
                if (result == BLE_STATUS_SUCCESS)
                {
                  APP_DBG_MSG("* GATT : Start Searching Primary Services \r\n\r");
                }
                else
                {
                  APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
                }
                /* Now try to connect to device 6 */
                if ((BleApplicationContext.EndDevice_Connection_Status[5] != APP_BLE_CONNECTED)
                    && (BleApplicationContext.EndDevice6Found == 0x01))
                {
                  UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_6_ID, CFG_SCH_PRIO_0);
                }
              }
              if (dev6 == 1)
              {
                /* Inform Application it is End Device 6 */
                APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 6\n");

                BleApplicationContext.EndDevice_Connection_Status[5] = APP_BLE_CONNECTED;
                BleApplicationContext.connectionHandleEndDevice6 = connection_handle;
                BleApplicationContext.BleApplicationContext_legacy.connectionHandle[5] = connection_handle;
                handleNotification.P2P_Evt_Opcode = P2P_SERVER6_CONN_HANDLE_EVT;
                handleNotification.ConnectionHandle = connection_handle;
                Evt_Notification(&handleNotification);
                result = aci_gatt_disc_all_primary_services(BleApplicationContext.connectionHandleEndDevice6);
                if (result == BLE_STATUS_SUCCESS)
                {
                  APP_DBG_MSG("* GATT : Start Searching Primary Services \r\n\r");
                }
                else
                {
                  APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
                }
                /* Now try to connect to device 5 */
                if ((BleApplicationContext.EndDevice_Connection_Status[4] != APP_BLE_CONNECTED)
                    && (BleApplicationContext.EndDevice5Found == 0x01))
                {
                  UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_5_ID, CFG_SCH_PRIO_0);
                }
              }
              /* USER CODE END EVT_LE_CONN_COMPLETE_Multi_4 */
#endif
          }
          else
          {
            APP_DBG_MSG("-- CONNECTION SUCCESS WITH SMART PHONE\n\r");
            BleApplicationContext.connectionHandleCentral = connection_handle;
            handleNotification.P2P_Evt_Opcode = SMART_PHONE1_CONN_HANDLE_EVT;
            handleNotification.ConnectionHandle = connection_handle;
            Evt_Notification(&handleNotification);
          }
          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

